_posts/2010-09-01-program.html
---
title:  编程杂记
category:  note
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>编程杂记</title>
<!-- 2014-12-02 二 21:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="robin1001" />
<link rel="stylesheet" type="text/css" href="/css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">编程杂记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. python的函数式特性</a>
<ul>
<li><a href="#sec-1-1">1.1. 函数赋值</a></li>
<li><a href="#sec-1-2">1.2. lambda</a></li>
<li><a href="#sec-1-3">1.3. 内置函数</a></li>
<li><a href="#sec-1-4">1.4. 消除控制流</a></li>
<li><a href="#sec-1-5">1.5. 列表推导</a></li>
<li><a href="#sec-1-6">1.6. 闭包，计算函数的导数</a></li>
</ul>
</li>
<li><a href="#sec-2">2. cc</a>
<ul>
<li><a href="#sec-2-1">2.1. Google C++ Style Guide</a></li>
<li><a href="#sec-2-2">2.2. 标准库比较接口</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> python的函数式特性</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 函数赋值</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">square</span>(n):
        <span style="color: #a020f0;">return</span> n*n
<span style="color: #a0522d;">f</span> = square
square(10)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> lambda</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a0522d;">square</span> = <span style="color: #a020f0;">lambda</span> x: x*x;
square(10)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 内置函数</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #483d8b;">map</span>(square, [1, 2, 3])
<span style="color: #483d8b;">reduce</span> &amp; <span style="color: #483d8b;">filter</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 消除控制流</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">func1</span>(lst) :
  <span style="color: #a0522d;">new_lst</span> = []
  <span style="color: #a020f0;">for</span> n <span style="color: #a020f0;">in</span> lst :
        <span style="color: #a020f0;">if</span> odd(n) :
          new_lst.append(square(n))
  <span style="color: #a020f0;">return</span> new_lst
&#21487;&#20197;&#25913;&#36827;&#20026;
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">func2</span>(lst) :
  <span style="color: #a020f0;">return</span> <span style="color: #483d8b;">map</span>(square, <span style="color: #483d8b;">filter</span>(odd, lst))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 列表推导</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-python">[x <span style="color: #a020f0;">for</span> x <span style="color: #a020f0;">in</span> lis <span style="color: #a020f0;">if</span> x % 2 == 0]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 闭包，计算函数的导数</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">d</span>(f) :
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">calc</span>(x) :
        <span style="color: #a0522d;">dx</span> = 0.000001  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#34920;&#31034;&#26080;&#31351;&#23567;&#30340;&#916;x</span>
        <span style="color: #a020f0;">return</span> (f(x+dx) - f(x)) / dx  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#35745;&#31639;&#26012;&#29575;&#12290;&#27880;&#24847;&#65292;&#27492;&#22788;&#24341;&#29992;&#20102;&#22806;&#23618;&#20316;&#29992;&#22495;&#30340;&#21464;&#37327; f</span>
  <span style="color: #a020f0;">return</span> calc  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#27492;&#22788;&#29992;&#20989;&#25968;&#20316;&#20026;&#36820;&#22238;&#20540;&#65288;&#20063;&#23601;&#26159;&#20989;&#25968; f &#30340;&#23548;&#25968;&#65289;</span>

<span style="color: #a0522d;">f</span> = <span style="color: #a020f0;">lambda</span> x : x**2 + x + 1  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#20808;&#25226;&#20108;&#27425;&#20989;&#25968;&#29992;&#20195;&#30721;&#34920;&#36798;&#20986;&#26469;</span>
<span style="color: #a0522d;">f1</span> = d(f)  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#36825;&#20010;f1 &#23601;&#26159; f &#30340;&#19968;&#38454;&#23548;&#25968;&#21862;&#12290;&#27880;&#24847;&#65292;&#23548;&#25968;&#20381;&#28982;&#26159;&#20010;&#20989;&#25968;</span>

f1(3)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> cc</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Google C++ Style Guide</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>函数超过10行时不要使用內联
</li>
<li>-inl.h內联函数实现文件 | 定义函数模板
</li>
<li>输入：const型，输出参数：指针
</li>
<li>最好给纯接口类加上Interface后缀
</li>
<li>名称为foo_的变量其访问函数为foo()，而其修改器(mutator)则为set_foo()，访问器常在头文件中定义为内联函数。
</li>
<li>请按下面的规则次序来定义类：公共成员位于私有成员前；方法位于数据成员前(变量)等等。
</li>
<li>scoped_ptr | shared_ptr
</li>
<li>使用cpplint.py来检测风格错误
</li>
<li>类型转换(Casting),需要类型转换时请使用static_cast&lt;&gt;()
</li>
<li>类成员以下划线结束 int val_;
</li>
<li>禁止使用异常
</li>
<li>常量命名, 在名称前加k：kDaysInAWeek
</li>
<li>函数形式参数位置和花括号位置
</li>
</ul>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22;">ReturnType</span> <span style="color: #008b8b;">ClassName</span>::<span style="color: #0000ff;">ReallyLongFunctionName</span>(<span style="color: #228b22;">Type</span> <span style="color: #a0522d;">par_name1</span>) {
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 标准库比较接口</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>函数形式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">compare</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">b</span>) {
    <span style="color: #a020f0;">return</span> a &lt; b;
}
</pre>
</div>
<ul class="org-ul">
<li>函数对象
</li>
</ul>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Node</span> {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">left</span>, <span style="color: #a0522d;">right</span>, <span style="color: #a0522d;">parent</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">w</span>;
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">ch</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">id</span>;
    <span style="color: #0000ff;">Node</span>(): left(-1), <span style="color: #0000ff;">right</span>(-1), <span style="color: #0000ff;">parent</span>(-1), <span style="color: #0000ff;">w</span>(0) {}
    <span style="color: #0000ff;">Node</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">l</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">r</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ww</span>): left(l), <span style="color: #228b22;">right</span>(<span style="color: #a0522d;">r</span>), <span style="color: #228b22;">w</span>(<span style="color: #a0522d;">ww</span>), parent(-1) {}
};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">NodeCmp</span>{
    <span style="color: #228b22;">bool</span> <span style="color: #a020f0;">operator</span> <span style="color: #0000ff;">()</span> ( <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Node</span> *<span style="color: #a0522d;">n1</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Node</span> *<span style="color: #a0522d;">n2</span> ) {
        <span style="color: #a020f0;">return</span> n1-&gt;w &gt; n2-&gt;w;
    }
};
<span style="color: #228b22;">priority_queue</span>&lt;<span style="color: #228b22;">Node</span> *, <span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">Node</span> *&gt;, <span style="color: #228b22;">NodeCmp</span>&gt; <span style="color: #a0522d;">que</span>;
</pre>
</div>
<ul class="org-ul">
<li>友元形式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Distance</span> {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">node_id</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">dis</span>;
    <span style="color: #a020f0;">friend</span> <span style="color: #228b22;">bool</span> <span style="color: #a020f0;">operator</span> <span style="color: #0000ff;">&lt;</span> (<span style="color: #228b22;">Distance</span> <span style="color: #a0522d;">d1</span>, <span style="color: #228b22;">Distance</span> <span style="color: #a0522d;">d2</span>) {
        <span style="color: #a020f0;">return</span> d1.dis &gt; d2.dis;
    }
    <span style="color: #0000ff;">Distance</span>() {}
};
<span style="color: #228b22;">priority_queue</span>&lt;<span style="color: #228b22;">Distance</span>&gt; <span style="color: #a0522d;">que</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: robin1001</p>
<p class="date">Created: 2014-12-02 二 21:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
